N40E116/SDK_2_6_13_FRDM-KW38/devices/MKW38A4/drivers/fsl_lin_lpuart.c
    if (sendFlag == true)
    {
        if (linCurrentState->cntByte < linCurrentState->txSize)
        {
            /* Send checksum byte */
            if ((linCurrentState->txSize - linCurrentState->cntByte) == 1U)
            {
                LIN_LPUART_WriteByte(base, linCurrentState->checkSum);
            }
            /* Send data bytes */
            else
            {
                LIN_LPUART_WriteByte(base, *linCurrentState->txBuff);
            }
        }
        else
        {
            linCurrentState->currentEventId   = LIN_TX_COMPLETED;
            linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_DATA_COMPLETED;

            LIN_LPUART_DisableInterrupts(base, (uint32_t)kLPUART_RxDataRegFullFlag);
            /* callback function to handle event TX COMPLETED */
            if (linCurrentState->Callback != NULL)
            {
                linCurrentState->Callback(instance, linCurrentState);
            }
            /* Check if the transmission is non-blocking */
            if (linCurrentState->isTxBlocking == true)
            {
                linCurrentState->txCompleted = true;
            }
            /* Clear Bus bus flag */
            linCurrentState->isBusBusy = false;
            linCurrentState->isTxBusy  = false;
            /* Change node's current state to IDLE */
            (void)LIN_LPUART_GotoIdleState(base);
        }
    }
}

lin_status_t LIN_LPUART_Init(LPUART_Type *base,
                             lin_user_config_t *linUserConfig,
                             lin_state_t *linCurrentState,
                             uint32_t linSourceClockFreq)
{
    uint32_t temp;
    uint32_t osrValue;
    uint16_t sbrValue;
    lin_status_t retVal = LIN_SUCCESS;

    /* Assert parameters. */
    assert(NULL != linUserConfig);
    assert(0U != linUserConfig->baudRate);

    uint32_t instance = LIN_LPUART_GetInstance(base);

    if (linSourceClockFreq == 0U)
    {
        retVal = LIN_LPUART_STAT_CLOCK_GATED_OFF;
    }
    else
    {
        /* if autobaud is enabled */
        if ((true == linUserConfig->autobaudEnable) && (linUserConfig->nodeFunction == (bool)LIN_SLAVE))
        {
            /* Setting Slave's baudrate to 19200 will help Slave node always detect LIN Break from Master */
            linUserConfig->baudRate                    = 19200U;
            linCurrentState->fallingEdgeInterruptCount = 0U;
            linCurrentState->baudrateEvalEnable        = true;
            s_previousTwoBitTimeLength[instance]       = 0U;
            s_countMeasure[instance]                   = 0U;
            s_timeMeasure[instance]                    = 0U;
        }
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
        /* LPUART init */
        CLOCK_EnableClock(s_lpuartClock[instance]);
#if defined(LPUART_PERIPH_CLOCKS)
        CLOCK_EnableClock(s_lpuartPeriphClocks[instance]);
#endif
#endif
        /* Reset values */
        base->CTRL = 0x00000000;
        /* Reset match addresses */
        base->MATCH = 0x00000000;
#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
        /* Reset IrDA modem features */
        base->MODIR = 0x00000000;
#endif
#if FSL_FEATURE_LPUART_FIFO_SIZEn(instance) > 0U
        /* Reset FIFO feature */
        base->FIFO = (LPUART_FIFO_RXUF_MASK | LPUART_FIFO_TXOF_MASK);
        /* Reset FIFO Watermark values */
        base->WATER = 0x00000000;
#endif

        if (LIN_LPUART_CalculateBaudRate(base, linUserConfig->baudRate, linSourceClockFreq, &osrValue, &sbrValue) ==
            kStatus_Success)
        {
            /* Set baudrate to User's value */
            LIN_LPUART_SetBaudRate(base, &osrValue, &sbrValue);

            /* config 8-bit (M=0) */
            LIN_LPUART_SetBitCountPerChar(base, LPUART_8_BITS_PER_CHAR);

            /* Set no parity mode */
            base->CTRL &= ~LPUART_CTRL_PE_MASK;
            base->CTRL &= ~LPUART_CTRL_PT_MASK;

            /* config 1 stop bit  */
            temp       = base->BAUD & ~LPUART_BAUD_SBNS_MASK;
            base->BAUD = temp | LPUART_BAUD_SBNS(kLPUART_OneStopBit);

            /* Set Break char transmit length as 13 bits minimum */
            if (linUserConfig->nodeFunction == (bool)LIN_MASTER)
            {
                base->STAT |= LPUART_STAT_BRK13_MASK;
            }

            (void)DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
            (void)DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#endif
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
            /* Set Break char detect length as 13 bits minimum and interrupt */
            base->STAT |= LPUART_STAT_LBKDE_MASK;
            LIN_LPUART_EnableInterrupts(base, (uint32_t)kLPUART_LinBreakInterruptEnable);
#endif

            LIN_LPUART_EnableInterrupts(
                base, ((uint32_t)kLPUART_FramingErrorInterruptEnable | (uint32_t)kLPUART_RxDataRegFullInterruptEnable));
            (void)EnableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
            (void)EnableIRQ(g_linLpuartErrIrqId[instance]);
#endif

            /* Change node's current state to IDLE */
            linCurrentState->currentNodeState   = LIN_NODE_STATE_IDLE;
            linCurrentState->linSourceClockFreq = linSourceClockFreq;
            /* Clear flags in current LIN state structure */
            linCurrentState->isTxBusy           = false;
            linCurrentState->isRxBusy           = false;
            linCurrentState->isBusBusy          = false;
            linCurrentState->isRxBlocking       = false;
            linCurrentState->isTxBlocking       = false;
            linCurrentState->timeoutCounterFlag = false;
            linCurrentState->timeoutCounter     = 0U;
            linCurrentState->txCompleted        = false;
            linCurrentState->rxCompleted        = false;
            linCurrentState->frame_index        = 0U;
            linCurrentState->framingError       = false;

            /* Assign wakeup signal to satisfy LIN Specifications specifies that
             * wakeup signal shall be in range from 250us to 5 ms.
             */
            if (linUserConfig->baudRate > 10000U)
            {
                /* Wakeup signal will be range from 400us to 800us depend on baudrate */
                s_wakeupSignal[instance] = 0x80U;
            }
            else
            {
                /* Wakeup signal will be range from 400us to 4ms depend on baudrate */
                s_wakeupSignal[instance] = 0xF8U;
            }
            if (!((true == linUserConfig->autobaudEnable) && (linUserConfig->nodeFunction == (bool)LIN_SLAVE)))
            {
                /* Enable the LPUART transmitter and receiver */
                base->CTRL |= (LPUART_CTRL_TE_MASK | LPUART_CTRL_RE_MASK);
            }
        }
        else
        {
            retVal = LIN_ERROR;
        }
    } /* End of if (linSourceClockFreq == 0U) */

    return retVal;
}

/*!
 * brief Shuts down the LIN_LPUART by disabling interrupts and transmitter/receiver.
 *
 * param instance LIN_LPUART instance number
 * return An error code or lin_status_t
 */
lin_status_t LIN_LPUART_Deinit(LPUART_Type *base)
{
    lin_status_t retVal          = LIN_SUCCESS;
    uint32_t instance            = LIN_LPUART_GetInstance(base);
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    if ((linCurrentState == NULL) || (linCurrentState->linSourceClockFreq == 0U))
    {
        retVal = LIN_ERROR;
    }
    else
    {
        /* Wait until the data is completely shifted out of shift register */
        while (0U == (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_TransmissionCompleteFlag))
        {
            /* Do nothing */
        }

        /* Disable the LPUART transmitter and receiver */
        base->CTRL &= ~(LPUART_CTRL_TE_MASK | LPUART_CTRL_RE_MASK);

