N40E116/SDK_2_6_13_FRDM-KW38/devices/MKW38A4/drivers/fsl_lin_lpuart.c
        /* Disable LPUART interrupt. */
        (void)DisableIRQ(g_linLpuartRxTxIrqId[instance]);
#ifdef LPUART_ERR_IRQS
        (void)DisableIRQ(g_linLpuartErrIrqId[instance]);
#endif

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
        /* Disable LPUART clock */
        CLOCK_DisableClock(s_lpuartClock[instance]);
#if defined(LPUART_PERIPH_CLOCKS)
        CLOCK_DisableClock(s_lpuartPeriphClocks[instance]);
#endif
#endif
        /* Change node's current state to UNINIT */
        linCurrentState->currentNodeState = LIN_NODE_STATE_UNINIT;

        /* Clear our saved pointer to the LIN state structure */
        g_linStatePtr[instance] = NULL;
    }

    return retVal;
}

/*!
 * brief Sends Frame data out through the LIN_LPUART module using blocking method.
 *
 * This function calculates the checksum byte and send it after the frame data.
 * Blocking means that the function does not return until the transmission is complete.
 *
 * param base LPUART peripheral base address
 * param txBuff source buffer containing 8-bit data chars to send
 * param txSize the number of bytes to send
 * param timeoutMSec timeout value in milli seconds
 * return An error code or lin_status_t
 */
lin_status_t LIN_LPUART_SendFrameDataBlocking(LPUART_Type *base,
                                              const uint8_t *txBuff,
                                              uint8_t txSize,
                                              uint32_t timeoutMSec)
{
    /* Assert parameters. */
    assert(NULL != txBuff);

    uint32_t instance = LIN_LPUART_GetInstance(base);
    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal          = LIN_SUCCESS;
    /* Check whether current mode is sleep mode */
    bool checkSleepMode = (LIN_NODE_STATE_SLEEP_MODE == linCurrentState->currentNodeState);

    /* Check if txSize > 8 or equal to 0 or node's current state
     * is in SLEEP mode then return STATUS_ERROR */
    if ((8U < txSize) || (0U == txSize) || checkSleepMode)
    {
        retVal = LIN_ERROR;
    }
    else
    {
        /* Check if the LIN Bus is busy */
        if (true == linCurrentState->isBusBusy)
        {
            retVal = LIN_BUS_BUSY;
        }
        else
        {
            /* Make the checksum byte. */
            linCurrentState->checkSum = LIN_MakeChecksumByte(txBuff, txSize, linCurrentState->currentPid);

            /* Update the LIN state structure. */
            linCurrentState->txBuff = txBuff;
            /* Add a place for checksum byte */
            linCurrentState->txSize         = txSize + 1U;
            linCurrentState->cntByte        = 0U;
            linCurrentState->currentEventId = LIN_NO_EVENT;
            linCurrentState->isBusBusy      = true;
            linCurrentState->isTxBusy       = true;
            linCurrentState->isTxBlocking   = true;
            linCurrentState->txCompleted    = false;

#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
            /* Set Break char detect length as 10 bits minimum */
            base->STAT &= ~LPUART_STAT_LBKDE_MASK;
#endif

            LIN_SetTimeoutCounter(instance, timeoutMSec);
            /* Set node's current state to SEND_DATA */
            linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_DATA;

            /* Start sending data */
            LIN_LPUART_WriteByte(base, *linCurrentState->txBuff);
        }
    }
    return retVal;
}

/*!
 * brief Sends frame data out through the LIN_LPUART module using non-blocking method.
 *
 * This enables an a sync method for transmitting data. Non-blocking means that the function returns immediately.
 * The application has to get the transmit status to know when the transmit is complete.
 * This function will calculate the checksum byte and send it with the frame data.
 *
 * param base LPUART peripheral base address
 * param txBuff source buffer containing 8-bit data chars to send
 * param txSize the number of bytes to send
 * return An error code or lin_status_t
 */
lin_status_t LIN_LPUART_SendFrameData(LPUART_Type *base, const uint8_t *txBuff, uint8_t txSize)
{
    /* Assert parameters. */
    assert(NULL != txBuff);

    uint32_t instance            = LIN_LPUART_GetInstance(base);
    lin_state_t *linCurrentState = g_linStatePtr[instance];
    lin_status_t retVal          = LIN_SUCCESS;
    bool checkSleepMode          = (LIN_NODE_STATE_SLEEP_MODE == linCurrentState->currentNodeState);

    /* Check if txSize > 8 or equal to 0 or node's current state
     * is in SLEEP mode then return STATUS_ERROR */
    if ((8U < txSize) || (0U == txSize) || checkSleepMode)
    {
        retVal = LIN_ERROR;
    }
    /* If txSixe is in range from 1 to 8 */
    else
    {
        /* Check if the LIN Bus is busy */
        if (true == linCurrentState->isBusBusy)
        {
            retVal = LIN_BUS_BUSY;
        }
        else
        {
            /* Make the checksum byte. */
            linCurrentState->checkSum = LIN_MakeChecksumByte(txBuff, txSize, linCurrentState->currentPid);

            /* Update the LIN state structure. */
            linCurrentState->txBuff = txBuff;
            /* Add a place for checksum byte */
            linCurrentState->txSize           = txSize + 1U;
            linCurrentState->cntByte          = 0U;
            linCurrentState->currentNodeState = LIN_NODE_STATE_SEND_DATA;
            linCurrentState->currentEventId   = LIN_NO_EVENT;
            linCurrentState->isBusBusy        = true;
            linCurrentState->isTxBusy         = true;

/* Set Break char detect length as 10 bits minimum */
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
            /* Set Break char detect length as 10 bits minimum */
            base->STAT &= ~LPUART_STAT_LBKDE_MASK;
#endif
            /* Start sending data */
            LIN_LPUART_WriteByte(base, *linCurrentState->txBuff);
        }
    }
    return retVal;
}

/*!
 * brief Get status of an on-going non-blocking transmission
 *  While sending frame data using non-blocking method, users can
 *  use this function to get status of that transmission.
 *  This function return LIN_TX_BUSY while sending, or LIN_TIMEOUT
 *  if timeout has occurred, or return LIN_SUCCESS when the transmission is complete.
 *  The bytesRemaining shows number of bytes that still needed to transmit.
 *
 * param base LPUART peripheral base address
 * param bytesRemaining  Number of bytes still needed to transmit
 * return lin_status_t LIN_TX_BUSY, LIN_SUCCESS or LIN_TIMEOUT
 */
lin_status_t LIN_LPUART_GetTransmitStatus(LPUART_Type *base, uint8_t *bytesRemaining)
{
    lin_status_t retVal = LIN_SUCCESS;

