N40E116/SDK_2_6_13_FRDM-KW38/devices/MKW38A4/drivers/fsl_lin_lpuart.c
            linCurrentState->fallingEdgeInterruptCount = 0U;
        }

        /* Check break time minimum. After autobaud calculation the break detect still needs to be left open,
           in case the break field is sent by master before the current frame completes. */
        if (tmpTime >= AUTOBAUD_BREAK_TIME_MIN)
        {
            /* If the break field is dected as framing error, clear the flag so that the framing error enent
               will not be invoked */
            if (linCurrentState->framingError == true)
            {
                linCurrentState->framingError = false;
            }
            /* If the current node state is still receive/send data when break detected, this indicate the lst frame's
               response is not complete */
            if ((linCurrentState->currentNodeState == LIN_NODE_STATE_RECV_DATA) ||
                (linCurrentState->currentNodeState == LIN_NODE_STATE_SEND_DATA))
            {
                if (linCurrentState->cntByte == 0U)
                {
                    /* Change the node's current event to NO RESPONSE */
                    linCurrentState->currentEventId = LIN_NO_RESPONSE_ERROR;
                }
                else
                {
                    /* Change the node's current event to LAST RESPONSE TOO SHORT */
                    linCurrentState->currentEventId = LIN_LAST_RESPONSE_SHORT_ERROR;
                }

                /* Callback function */
                if (linCurrentState->Callback != NULL)
                {
                    linCurrentState->Callback(instance, linCurrentState);
                }
            }

            /* Set flag LIN bus busy */
            linCurrentState->isBusBusy = true;

            /* Change the node's current state to RECEIVED BREAK FIELD */
            linCurrentState->currentEventId = LIN_RECV_BREAK_FIELD_OK;

            /* Callback function */
            if (linCurrentState->Callback != NULL)
            {
                linCurrentState->Callback(instance, linCurrentState);
            }

            /* Change the node's current state to RECEIVING SYNC FIELD */
            linCurrentState->currentNodeState = LIN_NODE_STATE_RECV_SYNC;
        }

        retVal = LIN_SUCCESS;
    }

    return retVal;
}

/*!
 * brief LIN_LPUART RX TX interrupt handler
 *
 * param base LPUART peripheral base address
 * return void
 */
void LIN_LPUART_IRQHandler(LPUART_Type *base)
{
    uint8_t tmpByte = 0xFFU;

    uint32_t instance = LIN_LPUART_GetInstance(base);

    /* Get the current LIN state of this LPUART instance. */
    lin_state_t *linCurrentState = g_linStatePtr[instance];

    /* Check RX Input Active Edge interrupt enable */
    bool activeEdgeIntState = (0U != (base->BAUD & ((uint32_t)1 << LPUART_BAUD_RXEDGIE_SHIFT))) ? true : false;

#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
    /* If LIN break character has been detected. */
    if (0U != (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_LinBreakFlag))
    {
        LIN_LPUART_ProcessBreakDetect(instance);
    }
    else
    {
#endif
        /* If LPUART_RX Pin Active Edge has been detected. */
        if (((uint32_t)kLPUART_RxActiveEdgeFlag ==
             (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_RxActiveEdgeFlag)) &&
            activeEdgeIntState)
        {
            /* Clear LPUART_RX Pin Active Edge Interrupt Flag. Write 1 to clear */
            (void)LIN_LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxActiveEdgeFlag);

            /* Check if the node is in SLEEP MODE */
            /* If yes, then check if a wakeup signal has been received */
            if (linCurrentState->currentNodeState == LIN_NODE_STATE_SLEEP_MODE)
            {
                LIN_LPUART_CheckWakeupSignal(instance);
            }
        }
        else
        {
            /* If Framing Error has been detected Write 1 to clear */
            if (0U != (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_FramingErrorFlag))
            {
                /* Clear Framing Error Interrupt Flag */
                (void)LIN_LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_FramingErrorFlag);

                /* Read dummy to clear LPUART_RX_DATA_REG_FULL flag */
                LIN_LPUART_ReadByte((const LPUART_Type *)(uint32_t)base, &tmpByte);

                /* Set frming error to true, do not abort current frame right now because premature break field
                   (13 bits of zero) can also cause framing error */
                linCurrentState->framingError = true;
            }
            else
            {
                if (0U != (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_RxDataRegFullFlag))
                {
                    /* Get data from Data Register & Clear LPUART_RX_DATA_REG_FULL flag */
                    (void)LIN_LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxDataRegFullFlag);
                    LIN_LPUART_ReadByte((const LPUART_Type *)(uint32_t)base, &tmpByte);

                    if (linCurrentState->framingError == true)
                    {
                        linCurrentState->framingError = false;

                        /* Set current event id to LIN_FRAME_ERROR */
                        linCurrentState->currentEventId = LIN_FRAME_ERROR;

                        if (linCurrentState->currentNodeState == LIN_NODE_STATE_SEND_DATA)
                        {
                            /* Callback function to handle Framing Error Event */
                            if (linCurrentState->Callback != NULL)
                            {
                                linCurrentState->Callback(instance, linCurrentState);
                            }
                        }

                        if (linCurrentState->isRxBlocking == false)
                        {
                            if (linCurrentState->currentNodeState == LIN_NODE_STATE_RECV_DATA)
                            {
                                /* Callback function to handle Framing Error Event */
                                if (linCurrentState->Callback != NULL)
                                {
                                    linCurrentState->Callback(instance, linCurrentState);
                                }
                            }
                        }

                        /* Clear Bus busy Flag */
                        linCurrentState->isBusBusy = false;
                        /* Change node's state to IDLE */
                        (void)LIN_LPUART_GotoIdleState(base);
                    }
                    else
                    {
                        /* Process data in Data Register while receive, send data */
                        LIN_LPUART_ProcessFrame(instance, tmpByte);
                    }
                }
            } /* End else: if (LIN_LPUART_GetStatusFlags(base) & kLPUART_FramingErrorFlag) */
        }     /* End else: if ((LIN_LPUART_GetStatusFlags(base) & kLPUART_RxActiveEdgeFlag) && activeEdgeIntState) */
#if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
    } /* End else: if (LIN_LPUART_GetStatusFlags(base) & kLPUART_LinBreakFlag) */
#endif

    /* Get status RX overrun flag */
    if ((uint32_t)kLPUART_RxOverrunFlag == (LIN_LPUART_GetStatusFlags(base) & (uint32_t)kLPUART_RxOverrunFlag))
    {
        /* Clear overrun flag */
        (void)LIN_LPUART_ClearStatusFlags(base, (uint32_t)kLPUART_RxOverrunFlag);
    }
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
} /* End void LIN_LPUART_DRV_IRQHandler(uint32_t instance) */
